insert into users
values ('db388879-f464-4d8b-9333-83f2a8a5f80b',
        'admin',
        '$2a$10$7EZv8IAZPhC5YCXrpBAo5.OGXUEqoQz5G0nJVXdUGYC7caz0Y5qhq');

INSERT INTO category
VALUES ('6032a379-8da9-4fd3-acec-e936e1ccf52b', 'Супы'),
       ('fd6f5b7b-cf37-4fdf-8fae-3702190511c1', 'Горячее'),
       ('a69533b8-2170-4782-81c8-e52ed0162cd1', 'Выпечка'),
       ('2b803362-4927-4d27-8ba3-b3a33ffbfe02', 'Салат');

INSERT INTO unit
VALUES ('fcdc68a6-b34d-4485-8098-7400408f8f19', 'шт.'),
       ('745916cb-2d33-449e-8bf6-72b54d4a6032', 'гр'),
       ('776b0e06-d105-428d-b465-bf6602a844e0', 'мл');

INSERT INTO product
VALUES ('b4175df9-35cd-4ec5-bbda-79f6b04b7826', 'Картофель'),
       ('92047c02-d44b-48b8-b7a7-de752ec625fc', 'Горох'),
       ('5490adac-1934-4873-84ff-3961f1fdf1fe', 'Помидор'),
       ('06b960a7-2645-444a-9aba-6938fcdea230', 'Огурец'),
       ('2c8a9152-e122-4b3c-b80f-d72816f89c23', 'Лук'),
       ('8f26fa95-940f-42c5-b16f-a7f21f666081', 'Макароны'),
       ('e544da30-b778-4455-ba88-564565306db1', 'Рис'),
       ('b7480c5c-8f00-4246-9bb5-e6c56cd4c341', 'Креветки'),
       ('b53453f8-09b5-4f06-9bea-30b66e888999', 'Говядина'),
       ('16807803-f5ce-4249-a127-1d27be1698e0', 'Свинина'),
       ('d1ba7bbe-7fad-4c2b-a88c-290883e27edd', 'Баранина'),
       ('f159587e-6a2a-4e2a-82db-3e66cb9806e0', 'Кабачок'),
       ('57176d1b-83ed-4174-83e1-50195c5235f7', 'Перец болгарский'),
       ('9753c0d9-188d-4e88-8af0-bb62ceb6f34e', 'Мука'),
       ('0c1ace31-9749-431a-b076-de19596db5fc', 'Молоко'),
       ('e0b3f465-3c72-44f6-9240-9337a9155b38', 'Яйцо'),
       ('a80a4f30-00de-44e4-8097-2b40cb2f1781', 'Овсянка'),
       ('30bc1b75-d247-4259-9746-1cfd20692ceb', 'Вода'),
       ('42eef4f7-6276-4f97-951f-77fafc47010e', 'Сметана');

insert into attachment
values('2d2e7807-dfb7-43b7-a32a-a2bed2a746f9', 'goroh.jpg');

INSERT INTO recipe
VALUES ('3ac29064-17a2-41e2-907f-53858c3e3b50', 'Суп гороховый', 'Очень сытный суп',
        'Промыть горох, варить вместе с мясом 1,5 ч после закипания, добавить картошку и морковку и варить ещё пол часа, добавить соль',
        '2d2e7807-dfb7-43b7-a32a-a2bed2a746f9',
        'db388879-f464-4d8b-9333-83f2a8a5f80b',
        '6032a379-8da9-4fd3-acec-e936e1ccf52b',
        '2025-02-08');

INSERT INTO ingredient
VALUES ('c10e0ff5-4e47-43f0-8f75-8e05ee49e297', '745916cb-2d33-449e-8bf6-72b54d4a6032',
        '3ac29064-17a2-41e2-907f-53858c3e3b50', 'b53453f8-09b5-4f06-9bea-30b66e888999',
        500),
       ('a93154b6-adeb-4c3b-9ef4-717db7540465', '745916cb-2d33-449e-8bf6-72b54d4a6032',
        '3ac29064-17a2-41e2-907f-53858c3e3b50', '92047c02-d44b-48b8-b7a7-de752ec625fc',
        500),
       ('055d158b-f058-4d18-812c-bec6ff67bff9', 'fcdc68a6-b34d-4485-8098-7400408f8f19',
        '3ac29064-17a2-41e2-907f-53858c3e3b50', 'b4175df9-35cd-4ec5-bbda-79f6b04b7826',
        4);